# 1자리 이상 10자리 이하의 16진수 H가 주어진다.H의 각 자리를 왼쪽부터
# 차례대로 4자리 2진수로 변환한 뒤, 변환한 결과를 이어 붙인다. 이때 각 자리의
# 앞에 있는 0도 생략하지 않는다. 변환한 2진수에서 값이 1인 자리의 개수를
# 구하여라. 예를 들어, A3에서 A는 1010, 3은 0011로 변환된다. 따라서 A3은
# 10100011로 나타내며, 1이 4개이므로 답은 4이다.


hex = {
    '0': '0000', '1': '0001', '2': '0010', '3': '0011',
    '4': '0100', '5': '0101', '6': '0110', '7': '0111',
    '8': '1000', '9': '1001', 'A': '1010', 'B': '1011',
    'C': '1100', 'D': '1101', 'E': '1110', 'F': '1111'
}

T = int(input())

for tc in range(1, T +1):

    A, B = input(),split()

    bin_a = ""
    for char in A:
        bin_a = bin_a + hex[char]

    print(f"#{tc} {bin_a}")



#좀만 더 볼 걸 그랬습니다... 송구합니다 강사님.. . 수고하셨습니다....

  # bin_b = ""
  #   for char in B:
  #       bin_b = bin_b + hex[char]